const product_01_image_01 =
  require("../images/products/product-01 (1).jpg").default;
const product_01_image_02 =
  require("../images/products/product-01 (2).jpg").default;
const product_01_image_03 =
  require("../images/products/product-01 (3).jpg").default;
const product_01_image_04 =
  require("../images/products/product-01 (4).jpg").default;
const product_01_image_05 =
  require("../images/products/product-01 (5).jpg").default;
const product_01_image_06 =
  require("../images/products/product-01 (6).jpg").default;
const product_01_image_07 =
  require("../images/products/product-01 (7).jpg").default;

// 222222222222222222222222222222222222222222222222
const product_02_image_01 =
  require("../images/products/product-02 (1).jpg").default;
const product_02_image_02 =
  require("../images/products/product-02 (2).jpg").default;
const product_02_image_03 =
  require("../images/products/product-02 (3).jpg").default;
const product_02_image_04 =
  require("../images/products/product-02 (4).jpg").default;
const product_02_image_05 =
  require("../images/products/product-02 (5).jpg").default;
const product_02_image_06 =
  require("../images/products/product-02 (6).jpg").default;
const product_02_image_07 =
  require("../images/products/product-02 (7).jpg").default;
// 333333333333333333333333333333333333333333
const product_03_image_01 =
  require("../images/products/product-03 (1).jpg").default;
const product_03_image_02 =
  require("../images/products/product-03 (2).jpg").default;
const product_03_image_03 =
  require("../images/products/product-03 (3).jpg").default;
const product_03_image_04 =
  require("../images/products/product-03 (4).jpg").default;
const product_03_image_05 =
  require("../images/products/product-03 (5).jpg").default;
const product_03_image_06 =
  require("../images/products/product-03 (6).jpg").default;
const product_03_image_07 =
  require("../images/products/product-03 (7).jpg").default;
// 4444444444444444444444444444444444444444444444444
const product_04_image_01 =
  require("../images/products/product-04 (1).jpg").default;
const product_04_image_02 =
  require("../images/products/product-04 (2).jpg").default;
const product_04_image_03 =
  require("../images/products/product-04 (3).jpg").default;
const product_04_image_04 =
  require("../images/products/product-04 (4).jpg").default;
const product_04_image_05 =
  require("../images/products/product-04 (5).jpg").default;
const product_04_image_06 =
  require("../images/products/product-04 (6).jpg").default;
// 555555555555555555555555555555555555555555555555
const product_05_image_01 =
  require("../images/products/product-05 (1).jpg").default;
const product_05_image_02 =
  require("../images/products/product-05 (2).jpg").default;

const product_06_image_01 =
  require("../images/products/product-06 (1).jpg").default;
const product_06_image_02 =
  require("../images/products/product-06 (2).jpg").default;

const product_07_image_01 =
  require("../images/products/product-07 (1).jpg").default;
const product_07_image_02 =
  require("../images/products/product-07 (2).jpg").default;

const product_08_image_01 =
  require("../images/products/product-08 (1).jpg").default;
const product_08_image_02 =
  require("../images/products/product-08 (2).jpg").default;

const product_09_image_01 =
  require("../images/products/product-09 (1).jpg").default;
const product_09_image_02 =
  require("../images/products/product-09 (2).jpg").default;

const product_10_image_01 =
  require("../images/products/product-10 (1).jpg").default;
const product_10_image_02 =
  require("../images/products/product-10 (2).jpg").default;

const product_11_image_01 =
  require("../images/products/product-11 (1).jpg").default;
const product_11_image_02 =
  require("../images/products/product-11 (2).jpg").default;

const product_12_image_01 =
  require("../images/products/product-12 (1).jpg").default;
const product_12_image_02 =
  require("../images/products/product-12 (2).jpg").default;
const product_12_image_03 =
  require("../images/products/product-12 (3).jpg").default;
const products = [
  {
    title: "Фудболка Сайма",
    price: "600",
    image01: product_01_image_01,
    image02: product_01_image_02,
    image03: product_01_image_03,
    image04: product_01_image_04,
    image05: product_01_image_05,
    image06: product_01_image_06,
    image07: product_01_image_07,
    categorySlug: "ao-thun",
    colors: ["white", "red", "blue", "grey", "pink", "violet"],
    slug: "ouy-1",
    size: ["s", "m", "l", "xl"],
    description:
      "всем народам известно, что наш народ славится разнообразием ремесел, своими изделиями и изделиями ручной работы. Ремесла нашего народа, через кыргызские узоры раскрывают внутреннюю сущность вещей и предметов роскоши, визуально визуализируют торжество нашей комфортной жизнu Мы видим самые основные образцы кыргызских национальных орнаментов на страницах изделий декоративно-прикладного искусства, украшенных орнаментом. К ним относятся валенки, ковры, туши, ковры, прялки, шкуры, изделия из дерева и украшения из серебра и меди. К ним относятся шерсть, войлочная пряжа разных цветов, кожаная пряжа, цветные металлы, дерево и другие на выбор. Имеются случаи, когда в зависимости от назначения применения и особенностей расположения указанных изделий изменяются изображения нанесенных рисунков.Красочный вязаный крючком предмет, который рисует практически все узоры на своих рисунках, - это тушь. Обычно верхняя часть туши с двумя душами вышивается, а в средней части наносится один или два талисмана. Для нанесения туши мастера выбирают земляное полотно черного цвета. Ведь пышность выбранного для вышивания вида ниток и элегантность земляного полотна черного цвета в сочетании с разноцветным орнаментом делают повседневный войлок очень красивым украшением.Основные узоры туши включают в себя описание природы, характерной для кыргызских национальных орнаментов в целом (Солнце, новолуние, источник, круговорот воды), изображения живых существ (пять пальцев, нашивной палец, бараньи рога, коготь ворона», фазан, оленьи рога, конский отпечаток, башмак, , голубь» и другие), описание растений <br>Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов ",
  },
  {
    title: "Фyтболка реглан 02",
    price: "559",
    image01: product_02_image_01,
    image02: product_02_image_02,
    image03: product_02_image_03,
    image04: product_02_image_04,
    image05: product_02_image_05,
    image06: product_02_image_06,
    image07: product_02_image_07,

    categorySlug: "ao-thun",
    colors: ["white", "blue", "red", "qrey", "pink", "red"],
    slug: "ouy-02",
    size: ["s", "m"],
    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции. Можно заметить, что образцы пота, созданные для них, отличаются друг от друга, и их замыслы, выполненные с особой тщательностью, явно отличаются от моделей других потов. Обратите внимание, например, на серебряные, медные украшения и резные фигурки на потовых поверхностях, а также на «архарский Рог», «сурок», «вода», «сон», «лист».В то время среди коренного кыргызского народа были лучшие ювелиры. Люди высоко ценили и уважали ювелирных мастеров, которые плавили драгоценные металлы, такие как серебро и медь, смешивали их вместе с огнем и срывали с рук. Мы видим образцы кыргызских национальных орнаментов на серебряных изделиях, созданных золотыми руками этих народных украшений. По резьбе на серебряном изделии, сделанном в древние времена и сохранившемся до наших дней, можно прочесть символы, описывающие различные явления неба, воды и земли, ритуальные символы, а также магически-чудесные формы животных и растений. Для кыргызских жен ремесленники изготавливали такие изделия, как кольца, браслеты, серьги-гвоздики, канаты, венулы, опрыскиватели, пуговицы и т. д. Иногда подошвы кольца украшали не только камнями, но и узорами национального орнамента. Среди таких ",
  },
  {
    title: "Фудболки оверсайс 3",
    price: "790",
    image01: product_03_image_01,
    image02: product_03_image_02,
    image03: product_03_image_03,
    image04: product_03_image_04,
    image05: product_03_image_05,
    image06: product_03_image_06,
    image07: product_03_image_07,

    categorySlug: "ao-thun",
    colors: ["white", "red", "orange", "yellow", "blue", "pink"],
    slug: "ouy-03",
    size: ["m", "s"],
    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции. Можно заметить, что образцы пота, созданные для них, отличаются друг от друга, и их замыслы, выполненные с особой тщательностью, явно отличаются от моделей других потов. Обратите внимание, например, на серебряные, медные украшения и резные фигурки на потовых поверхностях, а также на «архарский Рог», «сурок», «вода», «сон», «лист».В то время среди коренного кыргызского народа были лучшие ювелиры. Люди высоко ценили и уважали ювелирных мастеров, которые плавили драгоценные металлы, такие как серебро и медь, смешивали их вместе с огнем и срывали с рук. Мы видим образцы кыргызских национальных орнаментов на серебряных изделиях, созданных золотыми руками этих народных украшений. По резьбе на серебряном изделии, сделанном в древние времена и сохранившемся до наших дней, можно прочесть символы, описывающие различные явления неба, воды и земли, ритуальные символы, а также магически-чудесные формы животных и растений. Для кыргызских жен ремесленники изготавливали такие изделия, как кольца, браслеты, серьги-гвоздики, канаты, венулы, опрыскиватели, пуговицы и т. д. Иногда подошвы кольца украшали не только камнями, но и узорами национального орнамента. ",
  },
  {
    title: "Футболка 04",
    price: "800",
    image01: product_04_image_01,
    image02: product_04_image_02,
    image03: product_04_image_03,
    image04: product_04_image_04,
    image05: product_04_image_05,
    image06: product_04_image_06,
    categorySlug: "ao-thun",
    colors: ["white", "orange", "green", "pink", "blue"],
    slug: "ouy-04",
    size: ["xl"],
    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции",
  },
  {
    title: "Футболка 05",
    price: "749",
    image01: product_05_image_01,
    image02: product_05_image_02,
    categorySlug: "ao-thun",
    colors: ["white", "pink", "blue"],
    slug: "ouy-05",
    size: ["xxl"],
    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции",
  },
  {
    title: "Футболка  06",
    price: "569",
    image01: product_06_image_01,
    image02: product_06_image_02,
    categorySlug: "ao-thun",
    colors: ["black"],
    slug: "ouy-06",
    size: ["s", "m", "xl"],
    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции",
  },
  {
    title: "Pубашка 07",
    price: "960",
    image01: product_07_image_01,
    image02: product_07_image_02,
    categorySlug: "ao-somi",
    colors: ["white", "red", "orange", "blue"],
    slug: "ao-somi-caro-07",
    size: ["l", "xl"],
    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции<br>Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в ",
  },
  {
    title: "Pyбашка 08",
    price: "940",
    image01: product_08_image_01,
    image02: product_08_image_02,
    categorySlug: "ao-somi",
    colors: ["white", "red", "black"],
    slug: "ao-somi-dai-tay-08",
    size: ["s", "m", "xl"],
    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции",
  },
  {
    title: "Рубашка 09",
    price: "980",
    image01: product_09_image_01,
    image02: product_09_image_02,
    categorySlug: "ao-somi",
    colors: ["white", "blue"],
    slug: "ao-somi-tay-dai-09",
    size: ["m"],
    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции",
  },
  {
    title: "Джинсы 10",
    price: "899",
    image01: product_10_image_01,
    image02: product_10_image_02,
    categorySlug: "quan-jean",
    colors: ["blue", "black"],
    slug: "quan-10",
    size: ["l"],
    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции",
  },
  {
    title: "Джинсы 11",
    price: "194000",
    image01: product_11_image_01,
    image02: product_11_image_02,
    categorySlug: "quan-jean",
    colors: ["blue", "black"],
    slug: "quan-jean-11",
    size: ["s", "m", "xl"],
    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции",
  },
  {
    title: "Джинсы 12",
    price: "890",
    image01: product_12_image_01,
    image02: product_12_image_02,
    image03: product_12_image_03,
    categorySlug: "quan-jean",
    colors: ["blue"],
    slug: "quan-jean-12",
    size: ["s", "m", "xl"],
    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции",
  },
  {
    title: "Áo thun Dinosaur 13",
    price: "189000",
    image01: product_01_image_01,
    image02: product_01_image_02,
    categorySlug: "ao-thun",
    colors: ["white", "red"],
    slug: "ao-thun-dinosaur-13",
    size: ["s", "m", "xl"],
    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции",
  },
  {
    title: "Áo thun Dinosaur 14",
    price: "159000",
    image01: product_02_image_01,
    image02: product_02_image_02,
    categorySlug: "ao-thun",
    colors: ["white", "blue"],
    slug: "ao-thun-dinosaur-14",
    size: ["s", "m"],
    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции",
  },
  {
    title: "Áo thun Dinosaur 15",
    price: "190000",
    image01: product_03_image_01,
    image02: product_03_image_02,
    categorySlug: "ao-thun",
    colors: ["red", "blue"],
    slug: "ao-thun-dinosaur-15",
    size: ["xl"],
    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции",
  },
  {
    title: "Áo somi dài tay 16",
    price: "194000",
    image01: product_08_image_01,
    image02: product_08_image_02,
    categorySlug: "ao-somi",
    colors: ["blue", "black"],
    slug: "ao-somi-dai-tay-16",
    size: ["m", "xl"],
    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции",
  },
  {
    title: "Áo somi tay dài 17",
    price: "194000",
    image01: product_09_image_01,
    image02: product_09_image_02,
    categorySlug: "ao-somi",
    colors: ["white", "blue"],
    slug: "ao-somi-tay-dai-17",
    size: ["s", "l", "xl"],
    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции",
  },
  {
    title: "Quần jean phong cách 18",
    price: "194000",
    image01: product_10_image_01,
    image02: product_10_image_02,
    categorySlug: "quan-jean",
    colors: ["blue", "black"],
    slug: "quan-jean-phong-cach-18",
    size: ["s", "m", "l", "xl"],
    description:
      "Совершенство народных украшений-их мастерство, глубокая загадочность, многообразие. По правде говоря, отец — мастер ювелирных изделий. Многие ювелиры до сих пор предпочитают держать под контролем все остальные виды искусства: столярное, роголистное, судоходное, кожевенное, плетеное, лодочное-и все это.Мы называем ремесленника, который возводит на твердые изделия земли. Среди них чернокнижник (кузнец), ювелир (столяр), мастер конного снаряжения (плетенец, гребец), плотник (седло, Северянин, матер), рогожник (рогожник), мастер кожаных изделий (Кирка, Кирка, Кирка, воронка, караван, шейкер). Следовательно, удлинение - это ювелирное дело, кузнечное дело, столярное дело, рогоз, обработка кожи. Мы часто знаем, что это попытки людей создавать красивые предметы из железа, дерева, рогов, костей, камня и многого другого. Таким образом, кузнечное дело — это кованое железо, серебряное дерево, шкуры, шкуры, камни и др. изделия ручной работы. Среди основных видов орнаментов железного тега, получивших широкое распространение в обществе,-«Рог», «кружево на пальцах», «острие ножа», «коготь вороны» и войлочные узоры «мечта», вышивка, мешковина, ковры, чий, конус, дерево, саженцы роговых изделий. В ювелирных изделиях декоративная роспись — это нанесение железа на женское приданое, основные части ремня, изделия из дерева, рога, кости, кожи, покрытие его серебром и придание художественному узору его поверхности. В этом ювелирном деле «осколок» известен как «гравировка»,инкрустация Опытные мастера изготовили шлейки для молодых женщин по особой традиции",
  },
  // 18 products
];

const getAllProducts = () => products;

const getProducts = (count) => {
  const max = products.length - count;
  const min = 0;
  const start = Math.floor(Math.random() * (max - min) + min);
  return products.slice(start, start + count);
};

const getProductBySlug = (slug) => products.find((e) => e.slug === slug);

const getCartItemsInfo = (cartItems) => {
  let res = [];
  if (cartItems.length > 0) {
    cartItems.forEach((e) => {
      let product = getProductBySlug(e.slug);
      res.push({
        ...e,
        product: product,
      });
    });
  }
  // console.log(res)
  // console.log('sorted')
  // console.log(res.sort((a, b) => a.slug > b.slug ? 1 : (a.slug < b.slug ? -1 : 0)))
  return res.sort((a, b) => (a.id > b.id ? 1 : a.id < b.id ? -1 : 0));
};

const productData = {
  getAllProducts,
  getProducts,
  getProductBySlug,
  getCartItemsInfo,
};

export default productData;
